Title: Subqueries
Slug: sql/subqueries
Category: SQL
Tags: SELECT, CAST, FROM, WHERE, LIMIT, avg
Date: 2017-08-27
Modified: 2017-08-27

#### Load ipython-sql extension

In [2]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [3]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### Using a subquery as a condition

In [9]:
%%sql

SELECT
    f.film_id
    , f.title
    , f.length
FROM
    film f
WHERE
    f.length > (
        SELECT
            avg(f.length)
        FROM
            film f
    )
LIMIT
    5

[(133, 'Chamber Italian', 117),
 (4, 'Affair Prejudice', 117),
 (5, 'African Egg', 130),
 (6, 'Agent Truman', 169),
 (11, 'Alamo Videotape', 126)]

#### Selecting a column with a subquery
This isn't the most practical example, but you can select individual columns using a subquery.

In [16]:
%%sql

SELECT
    f.film_id
    , f.title
    , f.length
    , (SELECT l.name FROM language l WHERE l.language_id = f.language_id)
FROM
    film f
LIMIT
    5

[(133, 'Chamber Italian', 117, 'English             '),
 (384, 'Grosse Wonderful', 49, 'English             '),
 (8, 'Airport Pollock', 54, 'English             '),
 (98, 'Bright Encounters', 73, 'English             '),
 (1, 'Academy Dinosaur', 86, 'English             ')]